---
kind: property
id: P:Autodesk.Revit.DB.Structure.RebarBendingDetailType.AngularDimensionsDisplayOption
source: html/f85b4cab-f904-1ff5-1a2e-f36897d167f2.htm
---
# Autodesk.Revit.DB.Structure.RebarBendingDetailType.AngularDimensionsDisplayOption Property

Identifies the angular dimensions display options.

## Syntax (C#)
```csharp
public BendingDetailAngularDimensionsDisplayOptions AngularDimensionsDisplayOption { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration